cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32LG980F128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMU</name>
      <version>5.7.0</version>
      <description>CMU</description>
      <baseAddress>0x400C8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMU</name>
        <value>32</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>CMU Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000C262C</resetValue>
          <resetMask>0x57FFFEEF</resetMask>
          <fields>
            <field>
              <name>HFXOMODE</name>
              <description>HFXO Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>4-48 MHz crystal oscillator.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFEXTCLK</name>
                  <description>An AC coupled buffer is coupled in series with HFXTAL_N, suitable for external sine wave (4-48 MHz). The sine wave should have a minimum of 200 mV peak to peak.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGEXTCLK</name>
                  <description>Digital external clock on HFXTAL_N pin. Oscillator is effectively bypassed.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXOBOOST</name>
              <description>HFXO Start-up Boost Current</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>50PCENT</name>
                  <description>50 %.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>70PCENT</name>
                  <description>70 %.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80PCENT</name>
                  <description>80 %.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100PCENT</name>
                  <description>100 % (default).</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXOBUFCUR</name>
              <description>HFXO Boost Buffer Current</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOSTUPTO32MHZ</name>
                  <description>Boost Buffer Current level when HFXO is below or equal to 32 MHz.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOSTABOVE32MHZ</name>
                  <description>Boost Buffer Current Level when HFXO is above 32 MHz.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXOGLITCHDETEN</name>
              <description>HFXO Glitch Detector Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFXOTIMEOUT</name>
              <description>HFXO Timeout</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8CYCLES</name>
                  <description>Timeout period of 8 cycles.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFXOMODE</name>
              <description>LFXO Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>32.768 kHz crystal oscillator.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFEXTCLK</name>
                  <description>An AC coupled buffer is coupled in series with LFXTAL_N pin, suitable for external sinus wave (32.768 kHz).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGEXTCLK</name>
                  <description>Digital external clock on LFXTAL_N pin. Oscillator is effectively bypassed.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFXOBOOST</name>
              <description>LFXO Start-up Boost Current</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFCLKDIV</name>
              <description>HFCLK Division</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFXOBUFCUR</name>
              <description>LFXO Boost Buffer Current</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFXOTIMEOUT</name>
              <description>LFXO Timeout</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8CYCLES</name>
                  <description>Timeout period of 8 cycles.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL0</name>
              <description>Clock Output Select 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCO</name>
                  <description>HFRCO (directly from oscillator).</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO (directly from oscillator).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK2</name>
                  <description>HFCLK/2.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK4</name>
                  <description>HFCLK/4.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK8</name>
                  <description>HFCLK/8.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK16</name>
                  <description>HFCLK/16.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO (directly from oscillator).</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCO</name>
                  <description>AUXHFRCO (directly from oscillator).</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL1</name>
              <description>Clock Output Select 1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO (directly from oscillator).</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO (directly from oscillator).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>HFCLK (undivided).</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXOQ</name>
                  <description>LFXO (qualified).</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXOQ</name>
                  <description>HFXO (qualified).</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCOQ</name>
                  <description>LFRCO (qualified).</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOQ</name>
                  <description>HFRCO (qualified).</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCOQ</name>
                  <description>AUXHFRCO (qualified).</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGCLK</name>
              <description>Debug Clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFLE</name>
              <description>High-Frequency LE Interface</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCORECLKDIV</name>
          <description>High Frequency Core Clock Division Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000010F</resetMask>
          <fields>
            <field>
              <name>HFCORECLKDIV</name>
              <description>HFCORECLK Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>HFCORECLK = HFCLK.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK2</name>
                  <description>HFCORECLK = HFCLK/2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK4</name>
                  <description>HFCORECLK = HFCLK/4.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK8</name>
                  <description>HFCORECLK = HFCLK/8.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK16</name>
                  <description>HFCORECLK = HFCLK/16.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK32</name>
                  <description>HFCORECLK = HFCLK/32.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK64</name>
                  <description>HFCORECLK = HFCLK/64.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK128</name>
                  <description>HFCORECLK = HFCLK/128.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK256</name>
                  <description>HFCORECLK = HFCLK/256.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK512</name>
                  <description>HFCORECLK = HFCLK/512.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFCORECLKLEDIV</name>
              <description>Additional Division Factor For HFCORECLKLE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFPERCLKDIV</name>
          <description>High Frequency Peripheral Clock Division Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x0000010F</resetMask>
          <fields>
            <field>
              <name>HFPERCLKDIV</name>
              <description>HFPERCLK Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>HFPERCLK = HFCLK.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK2</name>
                  <description>HFPERCLK = HFCLK/2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK4</name>
                  <description>HFPERCLK = HFCLK/4.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK8</name>
                  <description>HFPERCLK = HFCLK/8.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK16</name>
                  <description>HFPERCLK = HFCLK/16.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK32</name>
                  <description>HFPERCLK = HFCLK/32.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK64</name>
                  <description>HFPERCLK = HFCLK/64.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK128</name>
                  <description>HFPERCLK = HFCLK/128.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK256</name>
                  <description>HFPERCLK = HFCLK/256.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK512</name>
                  <description>HFPERCLK = HFCLK/512.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFPERCLKEN</name>
              <description>HFPERCLK Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFRCOCTRL</name>
          <description>HFRCO Control Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000380</resetValue>
          <resetMask>0x0001F7FF</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>HFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BAND</name>
              <description>HFRCO Band Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1MHZ</name>
                  <description>1 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7MHZ</name>
                  <description>7 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11MHZ</name>
                  <description>11 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14MHZ</name>
                  <description>14 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21MHZ</name>
                  <description>21 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28MHZ</name>
                  <description>28 MHz band. NOTE: Also set the TUNING value (bits 7:0) when changing band.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUDELAY</name>
              <description>HFRCO Start-up Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFRCOCTRL</name>
          <description>LFRCO Control Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>LFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
